app/Providers/AppServiceProvider.php

select * from `channels`
---
    public function boot()
    {
        \View::share('channels', Channel::all());